[0: Object { author: "Al Jazeera", title: "Nobel Peace Prize winners receive award in Oslo - Al Jazeera English", description: "Al Jazeera will be live at 16:00 GMT to speak to the recipients about the importance of civil society in a time of war.", … }
​
1: Object { title: "Kyrsten Sinema Leaves The Democratic Party And Registers As An Independent | Us News | English News - CNN-News18", description: "Kyrsten Sinema Leaves The Democratic Party And Registers As An Independent | Us News | English NewsArizona Sen. Kyrsten Sinema is leaving the Democratic Part...", url: "https://www.youtube.com/watch?v=VUnlWt7oNGE", … }
​
2: Object { author: "Stephen Shankland", title: "Why We're All Obsessed With ChatGPT, A Mind-Blowing AI Chatbot - CNET", description: "This artificial intelligence bot can converse, write poetry and program computers. Be careful how much you trust it, though.", … }
​
3: Object { author: "Jamey Keaten", title: "Russia grinds on in eastern Ukraine; Bakhmut 'destroyed' - The Associated Press - en Español", description: "KYIV, Ukraine (AP) — Russian forces have “destroyed” the eastern Ukrainian city of Bakhmut , President Volodymyr Zelenskyy said, while Ukraine's military on Saturday reported missile, rocket and air strikes in multiple parts of the country that Moscow is tryi…", … }
​
4: Object { author: "Aya Elamroussi", title: "After release from Russian custody, focus is on providing Brittney Griner and her family additional support, officials say - CNN", description: "After being imprisoned in Russia for nearly 10 months, WNBA star Brittney Griner's safe return to the US on Friday was marked by a stop at a Texas military medical facility for a routine evaluation, the US State Department said.", … }
​
5: Object { author: "Michael David Smith", title: "Myles Garrett says he’s impressed and not surprised by Baker Mayfield’s performance - NBC Sports", description: "Baker Mayfield‘s tenure in Cleveland did not end well, but one of his former teammates is rooting for him after his spectacular comeback on Thursday night.Browns defensive end Myles Garrett, who played with Mayfield for four years in Cleveland, said he went t…", … }
​
6: Object { author: "Wayne Chang, Rhea Mogul, Jessie Yeung", title: "Hong Kong pro-democracy media tycoon Jimmy Lai sentenced to 69 months in prison on fraud charge - CNN", description: "A Hong Kong court on Saturday sentenced jailed media mogul Jimmy Lai to five years and nine months in prison for fraud, in the latest legal challenge against the pro-democracy tycoon.", … }
​
7: Object { author: "Landon Mion", title: "Los Angeles city councilmember involved in fight at Christmas celebration - Fox News", description: "Los Angeles City Councilmember Kevin de León was involved in a fight at a Christmas tree lighting event. He said he was “assaulted” by “self-proclaimed activists.”", … }
​
8: Object { author: "https://www.facebook.com/bbcnews", title: "World Cup 2022: US sports journalist Grant Wahl dies in Qatar - BBC", description: "Grant Wahl, 48, collapses suddenly while watching the Argentina-Netherlands game.", … }
​
9: Object { author: "Deutsche Welle", title: "European Parliament VP taken into custody - DW (English)", description: "Greek MEP Eva Kaili has been detained along with four others. An unidentified Gulf state allegedly targeted officials \"with a significant political and/or strategic position\" to influence the EU Parliament.", … }
​
10: Object { title: "Investigators, cleanup crews begin scouring oil pipeline spill in Kansas - Reuters", description: "Emergency crews on Friday were preparing to labor through the weekend to clean up the largest U.S. crude oil spill in nearly a decade, with workers descending on this farming community from as far away as Mississippi.", url: "https://www.reuters.com/world/us/efforts-ongoing-clean-up-keystone-oil-leak-largest-us-spill-nearly-decade-2022-12-09/", … }
​
11: Object { author: "Charlie Scott, Craig Chisnall, Luke Brown", title: "How Argentina vs Netherlands descended into chaos – taunts, tantrums and tears - The Athletic", description: "Seventeen yellow cards, a sending off, a fracas and post-match rows - and Lionel Messi's Argentina booked a semi-final date with Croatia", … }
​
12: Object { title: "UFC 282 Embedded: Vlog Series - Episode 6 - UFC - Ultimate Fighting Championship", description: "Paddy, Jan and Jared Gordan wrap up their weight cuts. They hit the scales, then Bryce Mitchell, Ilia Topuria, Jared Gordan, Paddy Pimblett, Magomed Ankalaev...", url: "https://www.youtube.com/watch?v=erXilnmqPZA", … }
​
13: Object { author: "Lawrence Richard", title: "GOP lawmakers respond to latest 'Twitter Files' detailing Trump's ban, vow Big Tech will 'be held accountable' - Fox News", description: "Republican lawmakers, including Sen. Josh Hawley and Rep. Jim Jordan, responded to the latest installment of the \"Twitter Files\" which were released on Friday afternoon.", … }
​
14: Object { title: "The New Day are prepared to become Triple Crown Champions: SmackDown Exclusive, Dec. 9, 2022 - WWE", description: "After their win with Ricochet, The New Day say that was a preview for tomorrow night when they defeat Pretty Deadly to become the new NXT Tag Team Champions....", url: "https://www.youtube.com/watch?v=77OExH9-j_s", … }
​
15: Object { author: "Justine McDaniel", title: "Kari Lake sues Arizona elections officials over governor's race loss - The Washington Post", description: "Lake, who lost the Arizona governor's race, asked a court to throw out the election results.", … }
​
16: Object { title: "Health officials urge masks as flu cases spike in Massachusetts - CBS Boston", description: "The Department of Public Health said Friday that flu activity in Massachusetts is \"very high,\" with more than 5,400 new cases confirmed in the past week. WBZ...", url: "https://www.youtube.com/watch?v=sE2CAJT8gYM", … }
​
17: Object { author: "Tom Tapp", title: "Ronnie Turner Dies: Tina Turner’s Youngest Son, A Musician Who Was In ‘What’s Love Got To Do With It’ Was 62 - Deadline", description: "Ronnie Turner, the youngest son of Tina and Ike Turner who appeared in the 1993 biopic What’s Love Got to Do With it, died on Thursday according to social media posts from his mother and wife. He was 62. “Ronnie, you left the world far too early,” the 83-year…", … }
​
18: Object { title: "Big Ten Review Finds Play Should Have Been Ruled Dead Before Tanner Holden Game-Winner Against Rutgers | Eleve - Eleven Warriors", description: "A Big Ten review determined Thursday's officiating crew should have whistled the play dead before Tanner Holden hit his game-winning buzzer-beater against Rutgers.", url: "https://www.elevenwarriors.com/ohio-state-basketball/2022/12…-ruled-dead-before-tanner-holden-game-winner-against-rutgers", … }
​
19: Object { author: "https://www.facebook.com/bbcnews", title: "Ukraine war: US says Iran now Russia's 'top military backer' - BBC", description: "Washington says it has seen reports that the countries are considering jointly producing drones.", … }
​
length: 20
​

